ojc-core/bpelse/system-test/test/com/sun/jbi/engine/bpel/jbiadaptor/test/persistence/bpels/eventhandler/onAlarm/Basic/deployedFolder/onAlarm/onAlarmRepeatEveryOnlyWSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/onAlarmRepeatEveryOnlyWSDL"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/onAlarmRepeatEveryOnlyWSDL" name="onAlarmRepeatEveryOnlyWSDL" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types/>
    <message name="onAlarmRepeatEveryOnlyWSDLOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="onAlarmRepeatEveryOnlyWSDLOperationReply">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="onAlarmRepeatEveryOnlyWSDLPortType">
        <wsdl:operation name="onAlarmRepeatEveryOnlyWSDLOperation">
            <wsdl:input name="input1" message="tns:onAlarmRepeatEveryOnlyWSDLOperationRequest"/>
            <wsdl:output name="output1" message="tns:onAlarmRepeatEveryOnlyWSDLOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="onAlarmRepeatEveryOnlyWSDLBinding" type="tns:onAlarmRepeatEveryOnlyWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="onAlarmRepeatEveryOnlyWSDLOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/onAlarmRepeatEveryOnlyWSDL"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/onAlarmRepeatEveryOnlyWSDL"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="onAlarmRepeatEveryOnlyWSDLService">
        <wsdl:port name="onAlarmRepeatEveryOnlyWSDLPort" binding="tns:onAlarmRepeatEveryOnlyWSDLBinding">
            <soap:address location="http://localhost:18181/onAlarmRepeatEveryOnlyWSDLService/onAlarmRepeatEveryOnlyWSDLPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="onAlarmRepeatEveryOnlyWSDL1">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="onAlarmRepeatEveryOnlyWSDLPortTypeRole" portType="tns:onAlarmRepeatEveryOnlyWSDLPortType"/>
    </plnk:partnerLinkType>
</definitions>
